app/Controllers/Auth.php

SELECT *
FROM `user`
WHERE `nama_user` = 'admin'
 LIMIT 1
---
    public function loginProcess()
    {
        $session = session();
        $model = new UserModel();

        $username = $this->request->getVar('username');
        $password = $this->request->getVar('password');

        // Cari user berdasarkan username
        $data = $model->where('nama_user', $username)->first();