app/Controllers/Dashboard.php

SELECT COUNT(*) AS `numrows` FROM `mahasiswa`
SELECT COUNT(*) AS `numrows` FROM `dosen`
SELECT COUNT(*) AS `numrows` FROM `mata_kuliah`
SELECT COUNT(*) AS `numrows` FROM `ruangan`
SELECT COUNT(*) AS `numrows` FROM `jadwal`
---
    private function dashboardAdmin()
    {
        // Hubungkan ke database untuk menghitung data
        $db = \Config\Database::connect();

        $data = [
            'title' => 'Dashboard Admin',
            'total_mhs'   => $db->table('mahasiswa')->countAll(),
            'total_dosen' => $db->table('dosen')->countAll(),
            'total_mk'    => $db->table('mata_kuliah')->countAll(),
            'total_ruangan' => $db->table('ruangan')->countAll(),
            'total_jadwal'=> $db->table('jadwal')->countAll(),