app/Controllers/Jadwal.php

    public function create()
    {
        // Kirim semua data master ke view untuk dropdown
        $data = [
            'title' => 'Buat Jadwal Baru',
            'mk'    => $this->mkModel->findAll(),
            'dosen' => $this->dosenModel->findAll(),
            'ruangan' => $this->ruanganModel->findAll(),
---
SELECT *
FROM `dosen`
SELECT *
FROM `ruangan`