app/Controllers/KrsKhs.php

    public function index_khs()
    {
        $nim = session()->get('kode_peran');

        // MAGIC QUERY: Join 4 Tabel + Tabel Nilai Mutu
        // Tujuannya: Dapat SKS, Nama MK, dan Nilai Mutu (4.0, 3.0) sekaligus
        $db = \Config\Database::connect();
        $builder = $db->table('rencana_studi');
        $builder->select('rencana_studi.*, mata_kuliah.nama_mata_kuliah, mata_kuliah.kode_mata_kuliah, mata_kuliah.sks, nilai_mutu.nilai_mutu as bobot');
        $builder->join('jadwal', 'jadwal.id = rencana_studi.id_jadwal');
        $builder->join('mata_kuliah', 'mata_kuliah.id_mata_kuliah = jadwal.id_mata_kuliah');
        $builder->join('nilai_mutu', 'nilai_mutu.nilai_huruf = rencana_studi.nilai_huruf', 'left'); // Left join jaga-jaga kalau nilai belum keluar
        $builder->where('rencana_studi.nim', $nim);

        $khs = $builder->get()->getResultArray();
---
SELECT `rencana_studi`.*, `mata_kuliah`.`nama_mata_kuliah`, `mata_kuliah`.`kode_mata_kuliah`, `mata_kuliah`.`sks`, `nilai_mutu`.`nilai_mutu` as `bobot`
FROM `rencana_studi`
JOIN `jadwal` ON `jadwal`.`id` = `rencana_studi`.`id_jadwal`
JOIN `mata_kuliah` ON `mata_kuliah`.`id_mata_kuliah` = `jadwal`.`id_mata_kuliah`
LEFT JOIN `nilai_mutu` ON `nilai_mutu`.`nilai_huruf` = `rencana_studi`.`nilai_huruf`
WHERE `rencana_studi`.`nim` = 'NIM 1'