app/Controllers/Mahasiswa.php

    public function index()
{
    $data = [
        'title' => 'Data Mahasiswa',
        'mahasiswa' => $this->mhsModel->orderBy('created_at', 'DESC')->findAll()
---
SELECT *
FROM `mahasiswa`
ORDER BY `created_at` DESC