app/Controllers/Penilaian.php

SELECT *
FROM `jadwal`
JOIN `mata_kuliah` ON `mata_kuliah`.`id_mata_kuliah` = `jadwal`.`id_mata_kuliah`
JOIN `ruangan` ON `ruangan`.`id_ruangan` = `jadwal`.`id_ruangan`
WHERE `jadwal`.`nidn` = '001'
---
    public function index()
    {
        $nidn = session()->get('kode_peran');
        $model = new JadwalModel();

        // Custom Query: Cari jadwal dimana dosennya adalah user yang login
        // Kita reuse method getJadwalLengkap tapi difilter manual di view/query
        // Agar cepat, kita pakai query builder sederhana saja
        $db = \Config\Database::connect();
        $jadwal_ajar = $db->table('jadwal')
                          ->join('mata_kuliah', 'mata_kuliah.id_mata_kuliah = jadwal.id_mata_kuliah')
                          ->join('ruangan', 'ruangan.id_ruangan = jadwal.id_ruangan')
                          ->where('jadwal.nidn', $nidn)
                          ->get()->getResultArray();

SELECT *
FROM `jadwal`
JOIN `mata_kuliah` ON `mata_kuliah`.`id_mata_kuliah` = `jadwal`.`id_mata_kuliah`
WHERE `jadwal`.`id` = '5'
SELECT *
FROM `rencana_studi`
JOIN `mahasiswa` ON `mahasiswa`.`nim` = `rencana_studi`.`nim`
WHERE `rencana_studi`.`id_jadwal` = '5'
---
    public function input($id_jadwal)
    {
        $db = \Config\Database::connect();

        // 1. Ambil Info Jadwal
        $jadwal = $db->table('jadwal')
                     ->join('mata_kuliah', 'mata_kuliah.id_mata_kuliah = jadwal.id_mata_kuliah')
                     ->where('jadwal.id', $id_jadwal)
                     ->get()->getRowArray();

        // 2. Ambil Daftar Mahasiswa yang ambil jadwal ini (Join KRS & Mhs)
        $mahasiswa = $db->table('rencana_studi')
                        ->join('mahasiswa', 'mahasiswa.nim = rencana_studi.nim')
                        ->where('rencana_studi.id_jadwal', $id_jadwal)
                        ->get()->getResultArray();