app/Controllers/Ruangan.php

SELECT *
FROM `ruangan`
---
    public function index()
    {
        $data = [
            'title' => 'Data Ruangan',
            'ruangan' => $this->ruanganModel->findAll()