app/Models/JadwalModel.php

SELECT `jadwal`.*, `mata_kuliah`.`kode_mata_kuliah`, `mata_kuliah`.`nama_mata_kuliah`, `mata_kuliah`.`sks`, `dosen`.`nama` as `nama_dosen`, `ruangan`.`nama_ruangan`
FROM `jadwal`
JOIN `mata_kuliah` ON `mata_kuliah`.`id_mata_kuliah` = `jadwal`.`id_mata_kuliah`
JOIN `dosen` ON `dosen`.`nidn` = `jadwal`.`nidn`
JOIN `ruangan` ON `ruangan`.`id_ruangan` = `jadwal`.`id_ruangan`
ORDER BY `hari` DESC
---
    public function getJadwalLengkap()
    {
        return $this->select('jadwal.*,
                              mata_kuliah.kode_mata_kuliah,
                              mata_kuliah.nama_mata_kuliah,
                              mata_kuliah.sks,
                              dosen.nama as nama_dosen,
                              ruangan.nama_ruangan')
                    ->join('mata_kuliah', 'mata_kuliah.id_mata_kuliah = jadwal.id_mata_kuliah')
                    ->join('dosen', 'dosen.nidn = jadwal.nidn')
                    ->join('ruangan', 'ruangan.id_ruangan = jadwal.id_ruangan')
                    ->orderBy('hari', 'DESC')
                    ->findAll();